src_doc/InformationRegisters/ОтметкиВремениРегистровКонстант.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОтметкиВремениРегистровКонстант</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отметка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидКлюча</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКлючейОтметокВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначенияКлюча</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникиДляОтметокВремени</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторКлюча</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипКлюча</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Граница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/InformationRegisters/ОтметкиВремениРегистровКонстант/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра(
		"СмещениеВремени", ТекущаяДатаСеанса() - ТекущаяУниверсальнаяДата());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КлючПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор);
	
	Если Не ЗначениеЗаполнено(Ключ) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, , "ОтборИдентификаторКлюча");
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, , "ОтборОбъект");
	ИначеЕсли СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Ключ) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор,
			"ИдентификаторКлюча",
			Новый УникальныйИдентификатор(Ключ),,
			"ОтборИдентификаторКлюча",,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлючОчистка(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, , "ОтборИдентификаторКлюча");
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, , "ОтборОбъект");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ЗапросыДанных = Новый Массив;
	ЗапросыОчереди = Новый Массив;
	
	Ключи = Новый Массив;
	Наборы = Новый Соответствие;
	Запрос = Новый Запрос();
	
	Данные = Новый Массив;
	
	Для Каждого Строка Из Строки Цикл
		ТекущиеДанные = Строка.Значение.Данные;
		Если ТекущиеДанные.ВидКлюча = Перечисления.ВидыКлючейОтметокВремени.КлючНабораИдентификаторНабораЗаписей
				И ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторКлюча) Тогда
			
			Данные.Добавить(ТекущиеДанные);
			
			Если ТекущиеДанные.Удаление Тогда
				Если Наборы["Удаление"] = Неопределено Тогда
					ТекстОчереди = 
						"ВЫБРАТЬ
						|	Т.ИдентификаторКлюча КАК _ИдентификаторКлюча,
						|	Т.ТипКлюча КАК _ТипКлюча,
						|	Т.Объект КАК _Объект,
						|	ИСТИНА КАК _Удаление,
						|	Т.Отметка КАК Отметка,
						|	Т.ЗначенияКлюча КАК ЗначенияКлюча
						|ИЗ
						|	РегистрСведений.ОтметкиВремениРегистровКонстант КАК Т
						|ГДЕ
						|	Т.ВидКлюча = ЗНАЧЕНИЕ(Перечисление.ВидыКлючейОтметокВремени.КлючНабораИдентификаторНабораЗаписей)
						|		И Т.Удаление = ИСТИНА
						|		И Т.ТипКлюча = НЕОПРЕДЕЛЕНО
						|		И Т.ИдентификаторКлюча В (&Ключи)";
					
					ЗапросыОчереди.Добавить(ТекстОчереди);
					Наборы.Вставить("Удаление", ЗапросыОчереди.ВГраница());
				КонецЕсли;
			Иначе
				Если Наборы[ТекущиеДанные.Объект] = Неопределено Тогда
					Метаданное = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ТекущиеДанные.Объект, Ложь);
					Если Метаданное = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					ИменаПолей = Новый Массив;
					Счетчик = Формат(ЗапросыДанных.ВГраница() + 1, "ЧГ=0");
					
					Набор = РегистрыСведений[Метаданное.Имя].СоздатьНаборЗаписей();
					Для Каждого ПолеОтбора Из Набор.Отбор Цикл
						ИменаПолей.Добавить(ПолеОтбора.Имя);
						ПолеОтбора.Использование = Истина;
					КонецЦикла;
					
					ТекстДанных =
						"ВЫБРАТЬ
						|	Таблица.ИдентификаторОтметкиВремени КАК _ИдентификаторКлюча,
						|	НЕОПРЕДЕЛЕНО КАК _ТипКлюча,
						|	&Объект КАК _Объект,
						|	ЛОЖЬ КАК _Удаление,
						|	&ИменаПолей
						|ИЗ
						|	#Таблица КАК Таблица
						|ГДЕ
						|	Таблица.ИдентификаторОтметкиВремени В(&Ключи)";
					ТекстДанных = СтрЗаменить(ТекстДанных, "#Таблица", Метаданное.ПолноеИмя());
					ТекстДанных = СтрЗаменить(ТекстДанных, "&ИменаПолей", СтрСоединить(ИменаПолей, ", "));
					ТекстДанных = СтрЗаменить(ТекстДанных, "&Объект", СтрШаблон("&Объект%1", Счетчик));
					
					ЗапросыДанных.Добавить(ТекстДанных);
					
					Запрос.УстановитьПараметр("Объект" + Счетчик, ТекущиеДанные.Объект);
					
					Наборы.Вставить(ТекущиеДанные.Объект, Набор);
					
					ИменаПолей.Очистить();
				КонецЕсли;
			КонецЕсли;
			
			Ключи.Добавить(ТекущиеДанные.ИдентификаторКлюча);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Ключи.Количество() Тогда
		
		Если ЗапросыОчереди.Количество() Тогда
			ЗапросыДанных.Добавить(СтрСоединить(ЗапросыОчереди, ОбщегоНазначения.ТекстОбъединитьВсе()));
		КонецЕсли;
		
		Запрос.Текст = СтрСоединить(ЗапросыДанных, ОбщегоНазначения.РазделительПакетаЗапросов());
		
		ЗапросыОчереди.Очистить();
		ЗапросыДанных.Очистить();
		
		Запрос.УстановитьПараметр("Ключи", Ключи);
		
		Пакет = Запрос.ВыполнитьПакет();
		
		Для Каждого Результат Из Пакет Цикл
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				Для Каждого ТекущиеДанные Из Данные Цикл
					Если ТекущиеДанные.ИдентификаторКлюча = Выборка._ИдентификаторКлюча
							И ТекущиеДанные.ТипКлюча = Выборка._ТипКлюча
							И ТекущиеДанные.Объект = Выборка._Объект
							И ТекущиеДанные.Удаление = Выборка._Удаление Тогда
						
						Если ТекущиеДанные.Удаление Тогда
							Если ТекущиеДанные.Отметка = Выборка.Отметка Тогда
								Попытка
									ТекущиеДанные.ЗначенияКлюча = Строка(Выборка.ЗначенияКлюча.Получить());
								Исключение
									ТекущиеДанные.ЗначенияКлюча = ОписаниеОшибки();
								КонецПопытки;
								
								Прервать;
							КонецЕсли;
						Иначе
							Набор = Наборы[ТекущиеДанные.Объект];
							Для Каждого Поле Из Набор.Отбор Цикл
								Поле.Значение = Выборка[Поле.Имя];
							КонецЦикла;
							
							ТекущиеДанные.ЗначенияКлюча = Набор.Отбор;
						КонецЕсли;
						
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		Данные.Очистить();
		Пакет.Очистить();
		Ключи.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные.ВидКлюча =
			ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ВидыКлючейОтметокВремени.КлючЗначенияКонстанты") Тогда
		
		//Константа
		ИмяОбъекта = ИмяОбъекта(ТекущиеДанные.Объект);
		Если ИмяОбъекта <> Неопределено Тогда
			ОткрытьФорму(ИмяОбъекта + ".ФормаКонстант");
		КонецЕсли;
	Иначе
		//Наборы записей
		ИмяОбъекта = ИмяОбъекта(ТекущиеДанные.Объект);
		Если ИмяОбъекта <> Неопределено Тогда
			СтруктураОтбора = Новый Структура(
				ПолеОбъекта(ТекущиеДанные.Объект),
				ЗначениеПоКлючуОтметокВремени(ТекущиеДанные.ИдентификаторКлюча, ТекущиеДанные.ТипКлюча, ТекущиеДанные.ВидКлюча));
				
			ОткрытьФорму(
				ИмяОбъекта + ".ФормаСписка",
				Новый Структура("Отбор", СтруктураОтбора),,
				ТекущиеДанные.ИдентификаторКлюча);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ИмяОбъекта(Идентификатор)
	
	Возврат ОтметкиВремениПовтИсп.ПолноеИмяОбъектаПоИдентификатору(Идентификатор);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолеОбъекта(Объект)
	
	Возврат ОтметкиВремени.ПолеКлючаОбъекта(Объект);
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеПоКлючуОтметокВремени(ИдентификаторКлюча, ТипКлюча, ВидКлюча)
	
	Если ОтметкиВремениПовтИсп.ЭтоВидКлючаСсылочногоТипа(ВидКлюча) Тогда
		Возврат ОтметкиВремени.ЗначениеСсылкиПоКлючуОтметкиВремени(ИдентификаторКлюча, ТипКлюча);
	КонецЕсли;
	
	Возврат ИдентификаторКлюча;
	
КонецФункции

#КонецОбласти
